app/controllers/microposts_controller.rb

    def create
    	@micropost = current_user.microposts.build(micropost_params)
	    if @micropost.save
---
INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "fdsf "], ["created_at", "2014-09-05 04:26:26.461299"], ["updated_at", "2014-09-05 04:26:26.461299"], ["user_id", 2]]