app/controllers/static_pages_controller.rb

SELECT  "microposts".* FROM "microposts"  WHERE "microposts"."user_id" = ?  ORDER BY created_at DESC LIMIT 30 OFFSET 0  [["user_id", 2]]
SELECT COUNT(*) FROM "microposts"  WHERE "microposts"."user_id" = ?  [["user_id", 2]]
---
  def home
    @micropost = current_user.microposts.build if signed_in?
    @feed_items = current_user.microposts.paginate(page: params[:page]) if signed_in?